[
    {
        "id": "60981677-a370-4d9e-add9-fe9ed763ba20",
        "title": "Generative AI Developer",
        "description": "Role Overview: We are seeking a highly motivated and skilled Generative AI Developer to join our innovative AI team. You will be responsible for designing, developing, fine-tuning, and deploying cutting-edge generative models (LLMs, diffusion models, etc.) to power new product features and internal capabilities. You will work closely with data scientists, machine learning engineers, and product managers to push the boundaries of AI.\nResponsibilities:\nResearch, design, and implement state-of-the-art generative models based on project requirements.\nFine-tune pre-trained large language models (LLMs) on custom datasets for specific tasks (e.g., text summarization, question answering, code generation).\nDevelop and optimize prompts for effective interaction with generative models (Prompt Engineering).\nProcess and prepare large datasets for model training and fine-tuning.\nWork with MLOps engineers to deploy, monitor, and maintain models in production environments (AWS SageMaker, GCP Vertex AI, or Azure ML).\nStay up-to-date with the latest advancements in Generative AI, NLP, and deep learning.\nCollaborate with cross-functional teams to integrate AI models into applications.\nEvaluate model performance, conduct error analysis, and iterate on model improvements.\nRequired Qualifications:\nBachelor's or Master's degree in Computer Science, AI, Machine Learning, or a related quantitative field.\nProven experience in developing and implementing machine learning models, particularly deep learning models.\nStrong programming skills in Python.\nHands-on experience with deep learning frameworks such as PyTorch or TensorFlow.\nExperience with NLP techniques and libraries (e.g., Hugging Face Transformers, spaCy, NLTK).\nFamiliarity with core concepts of Large Language Models (LLMs) and transformer architectures.\nExperience with data preprocessing and feature engineering.\nUnderstanding of model evaluation metrics and techniques.\nExperience with version control systems like Git.\nPreferred Qualifications:\nPhD in a relevant field.\nExperience with specific LLM frameworks like LangChain or LlamaIndex.\nExperience deploying models on cloud platforms (AWS, GCP, Azure).\nExperience with vector databases (e.g., Pinecone, ChromaDB, Weaviate).\nExperience with MLOps tools and practices.\nContributions to open-source AI/ML projects or publications in relevant conferences."
    },
    {
        "id": "6fb72f5d-4e22-4e77-9c0f-76600a3d985c",
        "title": "Frontend developer",
        "description": "Role Overview: We are looking for a passionate Frontend Developer to build intuitive, high-performance, and visually appealing user interfaces for our web applications. You will collaborate closely with UI/UX designers, backend developers, and product managers to translate requirements and designs into functional, responsive, and accessible web experiences using modern frontend technologies, primarily React.\nResponsibilities:\nDevelop new user-facing features using React.js and potentially Material UI (MUI).\nBuild reusable components and frontend libraries for future use.\nTranslate UI/UX designs and wireframes into high-quality code.\nOptimize components for maximum performance across a vast array of web-capable devices and browsers.\nIntegrate with backend services via RESTful APIs.\nWrite clean, maintainable, and testable code (using tools like Jest, React Testing Library).\nEnsure the technical feasibility of UI/UX designs.\nCollaborate with team members and stakeholders using Agile methodologies.\nStay updated on emerging frontend technologies and best practices.\nEnsure application adherence to accessibility standards (WCAG).\nRequired Qualifications:\nBachelor's degree in Computer Science or related field, or equivalent practical experience.\nProven experience as a Frontend Developer building web applications.\nStrong proficiency in JavaScript (ES6+), HTML5, and CSS3.\nIn-depth experience with React.js and its core principles (Components, State, Props, Hooks).\nExperience with popular React state management libraries (e.g., Redux Toolkit, Zustand, Context API).\nFamiliarity with RESTful APIs and asynchronous request handling.\nExperience with common frontend development tools such as Vite, Webpack, npm/yarn, and Git.\nUnderstanding of responsive design principles and cross-browser compatibility issues.\nPreferred Qualifications:\nExperience with TypeScript.\nExperience with UI component libraries, especially Material UI (MUI).\nExperience with frontend testing frameworks (Jest, React Testing Library, Cypress).\nFamiliarity with server-side rendering (SSR) or static site generation (SSG).\nUnderstanding of web performance optimization techniques.\nBasic understanding of backend development concepts.\nExperience with Agile/Scrum development processes."
    }
]